load-test.yml
# Load Testing Configuration for Artillery
# Run with: artillery run load-test.yml

config:
  target: 'http://localhost:8000'
  phases:
    # Phase 1: Warm up
    - duration: 60
      arrivalRate: 5
      name: "Warm up (5 users/sec)"
    
    # Phase 2: Ramp up
    - duration: 120
      arrivalRate: 10
      rampTo: 30
      name: "Ramp up (10-30 users/sec)"
    
    # Phase 3: Sustained load (500+ concurrent users)
    - duration: 300
      arrivalRate: 50
      name: "Sustained load (50 users/sec = 500+ concurrent)"
    
    # Phase 4: Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike test (100 users/sec)"
    
    # Phase 5: Cool down
    - duration: 60
      arrivalRate: 10
      name: "Cool down"

  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 500         # 95th percentile response time < 500ms
    p99: 1000        # 99th percentile response time < 1000ms

scenarios:
  # Scenario 1: Dashboard Load
  - name: "Dashboard Load Test"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber() }}@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/chats/recent"
          headers:
            Cookie: "token={{ authToken }}"
      
      - think: 2  # Wait 2 seconds
      
      - get:
          url: "/api/notifications"
          headers:
            Cookie: "token={{ authToken }}"

  # Scenario 2: Random Chat
  - name: "Random Chat Test"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber() }}@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - post:
          url: "/api/random/join-queue"
          headers:
            Cookie: "token={{ authToken }}"
      
      - think: 5
      
      - get:
          url: "/api/chats/recent"
          headers:
            Cookie: "token={{ authToken }}"

  # Scenario 3: Friend Chat
  - name: "Friend Chat Test"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber() }}@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/friends"
          headers:
            Cookie: "token={{ authToken }}"
      
      - think: 3
      
      - get:
          url: "/api/chats/recent"
          headers:
            Cookie: "token={{ authToken }}"

  # Scenario 4: Search
  - name: "Search Test"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber() }}@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/search?q=test&type=all"
          headers:
            Cookie: "token={{ authToken }}"